# https://www.acmicpc.net/problem/14852

N = int(input())
DP = [0] * (N+1)
'''
2xN 크기의 벽을 2x1, 1x2, 1x1 크기의 타일로 채우는 경우의 수 구하기
n-1   1
    1x1,1x2
n-2   2
    2x1,1x1 & 1x1 & 1x2, 1x2 & 1x1 & 1x1


n-4   4
    야래 2가지 경우를 추가로 고려해야 함
    ________________    ________________
    |_1_|___2__|__1|    |_______|_______|    
    |___2___|___2__|    |___|_______|___|

점화식 DP[N] = 3*DP[N-2] + 2*DP[N-1] + 2*DP[n-3] + 2*DP[n-4] + ... + 2*DP[0]

'''

DP[0:3] = [1,2,7]
summ = 0
for i in range(3,N+1):
    summ += DP[i-3]
    DP[i] = (3* DP[i-2]+ 2* DP[i-1] + 2*summ)%1000000007
print(DP[N])    